{
  "name": "Creative Technology Games",
  "path": "ct-games",
  "description": "<p>Ideated, built, and deployed client-side, configurable, game engines built with Phaser &amp HTML5, pre-configured with npm, bower, and gulp</p><p>Each game engine was built as a boilerplate to be configurable and programmable by producers, synced with an internal content management system. Custom artwork is uploaded for each game to offer unique themed experiences across Disney's properties. Each engine works across the media site network, with a focus on social integration.</p><p>Optional introduction/interstitial/endgame screens offer an opportunity for cohesive storytelling throughout the experience.</p><p>Variable complexity is introduced into each game in order to appeal to guests of many ages and skillsets.</p>",
  "date": "2016",
  "tools": [
    "Bower",
    "Gulp",
    "npm",
    "Phaser",
    "Nunjucks"
  ],
  "banner": {
    "src": "dory_five_cropped.jpg",
    "alt": "Finding Dory Game",
    "classes": "browser styled"
  },
  "images": [
    {
      "video": {
        "src": "pathtracer_dory",
        "controls": true
      },
      "alt": "Finding Dory Forgetful Friend Adventure Game",
      "classes": "browser styled",
      "heading": {
        "title": "Finding Dory Forgetful Friend Adventure",
        "desc": {
          "title": "play game",
          "href": "https://lol.disney.com/finding-dory-forgetful-friend-adventure"
        }
      },
      "caption": "A path tracing memory game, in which a path is initially drawn, fades out, and then the user is prompted to mimic the path. On success, a branded animation plays back the path, and the user then advances to the next level. On failure, the user is directed to a view with their score, and applicable personal best/high score information."
    },
    {
      "src": "dory_playing.jpg",
      "alt": "Finding Dory Forgetful Friend Adventure Game In Play",
      "classes": "browser styled image-right",
      "caption": "Additional connector points are introduced after x-num of successes to increase complexity. The speed of the initial path tracing is increased after the maximum number of connectors have been introduced."
    },
    {
      "video": {
        "src": "pathtracer_sw",
        "controls": true
      },
      "alt": "Star Wars Hyperspace Dash Game",
      "heading": {
        "title": "Star Wars Hyperspace Dash",
        "desc": {
          "title": "play game",
          "href": "https://lol.disney.com/star-wars-hyperspace-dash"
        }
      },
      "classes": "browser styled"
    },
    {
      "src": "tsum_play.jpg",
      "alt": "Tsum Tsum Mix",
      "classes": "browser styled",
      "heading": {
        "title": "Match 3 Generator",
        "desc": {
          "title": "play game",
          "href": "https://lol.disney.com/games/disney-tsum-tsum-mix"
        }
      },
      "caption": "A traditional match-3 engine custom built in phaser. A configurable number of tiles are generated (by either specifying the number of rows and/or columns, where filling the game space automatically is the default setting)."
    },
    {
      "src": "minnie_play.jpg",
      "alt": "Tsum Tsum Mix",
      "classes": "browser styled image-right",
      "caption": "The user finds combinations of 3 or more tiles (i.e. blue dots). When 3 or more are matched, the matched tiles collapse and additional ones animate in from the top of the screen to take their place, and the user is rewarded points based on the number of matched tiles. As the board is refilled, the game checks for any existing matches, and automatically collapses the matches and increments the score accordingly."
    },
    {
      "video": {
        "src": "filmflip",
        "controls": true
      },
      "alt": "Film Flip Memory Card Game",
      "classes": "browser styled",
      "heading": {
        "title": "Memory Card Generator",
        "desc": {
          "title": "play game",
          "href": "https://lol.disney.com/games/once-upon-a-pair"
        }
      },
      "caption": "A responsive HTML5 memory game, where a configurable number of image pairs are generated, with the images facing down. The user clicks on different cards, which flip over with a CSS animation. Only 2 cards can be selected at a given time."
    },
    {
      "src": "filmflip_mobile.jpg",
      "alt": "Film Flip Memory Card Game Mobile",
      "classes": "device iphone styled",
      "caption": "If a match is made, a 'matched' transition is applied to the cards and the score is incremented. If the cards aren't a match, they turn back over, and the user continues making match attempts. Once all cards have been matched, the cards flip back over, are assigned new pair values, and a new round begins."
    }
  ]
}
